Repository: pylapp/miso-ios-demo
Catalog: DesignToolbox/DesignToolbox/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr

# app_about_accessibilityStatement_label
source: Accessibility statement
ar: بيان إمكانية الوصول
fr: Déclaration d'accessibilité

# app_about_appSettings_hint_a11y
source: Tap twice to go to app settings
ar: انقر مرتين للانتقال إلى إعدادات التطبيق
fr: Appuyez deux fois pour accéder aux paramètres de l'application

# app_about_appSettings_label
source: Open app settings
ar: افتح إعدادات التطبيق
fr: Ouvrir les paramètres de l'application

# app_about_appSources_hint_a11y
source: Tap twice to go to the source code of this application on GitHub
ar: انقر مرتين للانتقال إلى الكود المصدري لهذا التطبيق على GitHub
fr: Appuyez deux fois pour accéder au code source de l’application disponible sur GitHub

# app_about_appSources_label
source: Source code of the app
ar: الكود المصدري للتطبيق
fr: Code source de l’app

# app_about_bugReport_hint_a11y
source: Tap twice to report a bug and send an improvement request for the app or the SDK
ar: انقر مرتين للإبلاغ عن خطأ وإرسال طلب تحسين للتطبيق أو SDK
fr: Appuyez deux fois pour envoyer un rapport de bug ou une demande d’amélioration de l’application ou du SDK

# app_about_bugReport_label
source: Report a bug
ar: الإبلاغ عن خطأ
fr: Signaler un bug

# app_about_changelog_hint_a11y
source: Tap twice to go the the changelog of the project
ar: انقر مرتين للانتقال إلى سجل التغيير عبر الإنترنت للمشروع
fr: Tappez deux fois pour accéder en ligne aux notes de versions

# app_about_changelog_label
source: See changelog
ar: انظر ملاحظات الإصدار
fr: Voir les notes de version

# app_about_designSystem_hint_a11y
source: Tap twice to go to the design system website
ar: انقر مرتين للانتقال إلى موقع نظام التصميم على الويب
fr: Appuyez deux fois pour accéder aux spécifications du système de design

# app_about_designSystem_label
source: Design system guidelines
ar: إرشادات نظام التصميم
fr: Spécifications du design system

# app_about_details_appVersion
source: App version
ar: إصدار التطبيق
fr: Version de l’app

# app_about_details_appVersion_stable
source: App version %@
ar: إصدار التطبيق %@
fr: Version de l’app %@

# app_about_details_buildNumber
source: Build number
ar: رقم البناء
fr: Numéro du build

# app_about_details_buildType
source: Build type
ar: نوع البناء
fr: Type de build

# app_about_details_githubBuildDetails
source: Build details (GitHub): %@
ar: تفاصيل البناء (GitHub): %@
fr: Détails du build (GitHub) : %@

# app_about_details_sdkVersion
source: SDK version:
ar: إصدار SDK: %@
fr: Version du SDK :

# app_about_details_themeCoreVersion
source: OUDS core tokens library version
ar: إصدار مكتبة رموز OUDS الأساسية
fr: Version des tokens core OUDS

# app_about_details_themeOrangeBrandVersion
source: Orange brand tokens library version
ar: إصدار مكتبة رموز العلامة التجارية Orange
fr: Version des tokens brand Orange

# app_about_details_themeOrangeCompactBrandVersion
source: Orange Compact brand tokens library version
ar: إصدار مكتبة الرموز المميزة للعلامة التجارية Orange Compact
fr: Version des tokens brand Orange Compact

# app_about_details_themeOrangeCoreVersion
source: Orange core tokens library version
ar: إصدار مكتبة رموز Orange core
fr: Version des tokens core Orange

# app_about_details_themeSoshBrandVersion
source: Sosh brand tokens library version
ar: إصدار مكتبة رموز العلامة التجارية Sosh
fr: Version des tokens brand Sosh

# app_about_details_themeSoshCoreVersion
source: Sosh core tokens library version
ar: إصدار مكتبة رموز Sosh الأساسية
fr: Version des tokens core Sosh

# app_about_details_themeWireframeBrandVersion
source: Wireframe brand tokens library version
ar: إصدار مكتبة رموز العلامة التجارية Wireframe
fr: Version des tokens brand Wireframe

# app_about_details_themeWireframeCoreVersion
source: Wireframe core tokens library version
ar: إصدار مكتبة رموز النواة للإطار السلكي
fr: Version des tokens core Wireframe

# app_about_legalInformation_label
source: Legal information
ar: المعلومات القانونية
fr: Informations légales

# app_about_privacyPolicy_label
source: Privacy policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

# app_bottomBar_about_label
source: About
ar: حول
fr: À propos

# app_bottomBar_components_label
source: Components
ar: مكونات
fr: Composants

# app_bottomBar_tokens_label
source: Tokens
ar: رموز

# app_common_configuration_label
source: Configuration
ar: إعدادات

# app_common_copy
source: Copy %@
ar: نسخ: %@
fr: Copier %@

# app_common_copyCode_a11y
source: Copy code
ar: نسخ الكود
fr: Copier le code

# app_common_customize_label
source: Customize
ar: تخصيص
fr: Personnaliser

# app_common_select_element
source: Select an element
ar: حدد عنصرا
fr: Sélectionnez un élément

# app_common_showCode_text
source: View token code example
ar: عرض مثال رمز الرمز المميز
fr: Voir l'exemple de code du token

# app_common_showCode_text_a11y
source: Toggle code visibility
ar: تبديل رؤية الكود
fr: Basculer la visibilité du code

# app_common_soonAvailable
source: Available soon!
ar: قريباً!
fr: Bientôt disponible !

# app_common_version
source: Version: %@
ar: إصدار:%@

# app_component_emptyContent_description_text
source: This content is under construction and will be available very soon
ar: هذا المحتوى قيد الإنشاء وسيكون متاحًا قريبًا جدًا
fr: Ce contenu est en cours de préparation et sera disponible très prochainement

# app_component_emptyContent_text
source: No content
ar: لا يوجد محتوى
fr: Pas de contenu

# app_components_alert_inlineAlert_description_text
source: Inline alert is a lightweight UI element, placed in the content flow, that displays information, system feedback, status changes throughout short, prominent, persistent and non actionable communication.
ar: InlineAlert هو عنصر واجهة مستخدم بسيط، يتم وضعه في تدفق المحتوى، حيث يعرض المعلومات وتعليقات النظام وتغييرات الحالة من خلال وسيلة اتصال لطيفة ومرئية ومستمرة وغير قابلة للاستغلال.
fr: Le composant InlineAlert est un élément d'interface utilisateur léger, placé dans le flux de contenu, qui affiche des informations, des commentaires système et des changements d'état au moyen d'une communication courte, visible, persistante et non exploitable.

# app_components_badge_description_text
source: Badge is a UI element that emphasizes system notifications, status, or the categorization of an information, throughout colour only. Badge is rendered as a coloured shape, without icon, text or number; and its chosen size remains unchanged regardless of the changes of the interface size.
ar: الشارة عنصر من عناصر واجهة المستخدم يُستخدم لتسليط الضوء على إشعارات النظام، أو الحالة، أو تصنيف المعلومات، وذلك من خلال اللون فقط. تُعرض الشارة كشكل ملون، بدون أيقونة أو نص أو رقم؛ ويبقى حجمها ثابتًا بغض النظر عن تغيير حجم واجهة المستخدم.
fr: Le badge est un élément de l'interface utilisateur qui met l'accent sur les notifications du système, l'état ou la catégorisation d'une information, uniquement par la couleur. Le badge est rendu sous la forme d'une forme colorée, sans icône, texte ou numéro ; et sa taille choisie reste inchangée quels que soient les changements de taille de l'interface.

# app_components_badge_hint_a11y
source: This is a dumb label for the badge with an icon
ar: هذه ملصق زائف للشارة مع ملف
fr: Ceci est un label bidon pour le badge avec une icône

# app_components_bottomAppBar_description_text
source: A tool bar bottom provides convenient access to frequently used commands, controls and search.
ar: يوفر شريط الأدوات السفلي وصولاً سهلاً إلى الأوامر وعناصر التحكم والبحث المستخدمة بشكل متكرر.
fr: Une barre d'outils en bas de l'écran offre un accès pratique aux commandes, aux contrôles et à la recherche fréquemment utilisés.

# app_components_bulletList_description_text
source: Bullet list is a UI element that helps to view in related individual text items grouped together; items usually starting with a number or a bullet. Bullet list is also known as “Unordered list” or “Ordered list” and is not an interactive element by default, although text items can support hypertext links.
ar: القائمة النقطية هي عنصر واجهة مستخدم يُساعد على عرض عناصر نصية فردية مترابطة مُجمّعة معًا؛ تبدأ العناصر عادةً برقم أو نقطة. تُعرف القائمة النقطية أيضًا باسم "القائمة غير المرتبة" أو "القائمة المرتبة"، وهي ليست عنصرًا تفاعليًا افتراضيًا، على الرغم من أن عناصر النص تدعم روابط النص التشعبي.
fr: La liste à puces est un élément d'interface utilisateur permettant d'afficher des éléments de texte individuels regroupés par thèmes ; ces éléments commencent généralement par un chiffre ou une puce. Également appelée « liste non ordonnée » ou « liste ordonnée », la liste à puces n'est pas interactive par défaut, bien que ses éléments puissent contenir des liens hypertextes.

# app_components_bulletList_oneLevel_label
source: One
ar: واحد
fr: Un

# app_components_bulletList_threeLevels_label
source: Three
ar: ثلاثة
fr: Trois

# app_components_bulletList_twoLevels_label
source: Two
ar: اثنين
fr: Deux

# app_components_button_appearence_notAllowed_text
source: Not allowed on colored surface
ar: غير مسموح به على الأسطح الملونة
fr: Non autorisé sur fond de couleur

# app_components_button_description_text
source: Button is a UI element that triggers an action or event, and is used to initiate tasks or confirming an action.
ar: الزر هو عنصر من عناصر واجهة المستخدم يقوم بتشغيل إجراء أو حدث، ويستخدم لبدء المهام أو تأكيد إجراء ما.
fr: Un bouton est un élément d'interface utilisateur qui déclenche une action ou un événement, et sert à lancer des tâches ou à confirmer une action.

# app_components_checkbox_checkbox_description_text
source: Checkbox is a UI element that allows to select multiple options from a set of mutually non exclusive choices. Checkbox that does not show icon or text, provides greater flexibility when creating other components that require a checkbox to be displayed.
ar: مربع الاختيار هو عنصر واجهة مستخدم يسمح بتحديد خيارات متعددة من مجموعة خيارات غير حصرية. يوفر مربع الاختيار الذي لا يعرض أيقونة أو نصًا مرونة أكبر عند إنشاء مكونات أخرى تتطلب عرض مربع اختيار.
fr: La case à cocher est un élément d'interface utilisateur permettant de sélectionner plusieurs options parmi un ensemble de choix non exclusifs. Une case à cocher sans icône ni texte offre une plus grande flexibilité lors de la création d'autres composants nécessitant son affichage.

# app_components_checkbox_checkboxItem_description_text
source: Checkbox item is a UI element that allows to select multiple options from a set of mutually non exclusive choices. Checkbox item covers a wider range of contexts by allowing to toggle the visibility of additional text labels and icon assets.
ar: مربع الاختيار المتقدم هو عنصر في واجهة المستخدم يتيح لك تحديد خيارات متعددة من مجموعة خيارات غير حصرية. يغطي مربع الاختيار المتقدم نطاقًا أوسع من السياقات من خلال السماح لك بتفعيل/إيقاف ظهور تسميات نصية وأيقونات إضافية.
fr: La case à cocher enrichie est un élément d'interface utilisateur qui permet de sélectionner plusieurs options parmi un ensemble de choix mutuellement non exclusifs. La case à cocher enriche couvre un plus large éventail de contextes en permettant de basculer la visibilité d’étiquettes de texte et d’icônes supplémentaires.

# app_components_checkbox_description_text
source: Checkbox is a UI element that allows to select multiple options from a set of mutually non exclusive choices.
ar: مربع الاختيار هو عنصر من عناصر واجهة المستخدم يسمح بتحديد خيارات متعددة من مجموعة من الخيارات غير الحصرية المتبادلة.
fr: La case à cocher est un élément de l'interface utilisateur qui permet de sélectionner plusieurs options parmi un ensemble de choix mutuellement non exclusifs.

# app_components_checkbox_hint_a11y
source: This is a fake label for the design system toolbox app
ar: هذه تسمية زائفة لتطبيق صندوق أدوات نظام التصميم
fr: Ceci est un label bidon pour l’app de démo du design system

# app_components_checkbox_indeterminateCheckbox_description_text
source: Indeterminate checkboxes allows users for example within a folder and file tree structure to select, unselect or partially select one or multiple items.
ar: Indeterminate checkboxes تسمح للمستخدمين، على سبيل المثال، ضمن بنية المجلدات والملفات، باختيار أو إلغاء اختيار عنصر واحد أو أكثر، أو اختيار جزئي لعدة عناصر.
fr: Le composant CheckboxIndeterminate est utilisé dans des structures de dossier et de fichiers ou l’utilisateur peut sélectionner, désélectionner ou sélectionner partiellement certains éléments.

# app_components_checkbox_indeterminateCheckboxItem_description_text
source: Indeterminate checkboxes allows users for example within a folder and file tree structure to select, unselect or partially select one or multiple items.
ar: Indeterminate checkboxes تسمح للمستخدمين، على سبيل المثال، ضمن بنية المجلدات والملفات، باختيار أو إلغاء اختيار عنصر واحد أو أكثر، أو اختيار جزئي لعدة عناصر.
fr: Le composant CheckboxIndeterminate Item est utilisé dans des structures de dossier et de fichiers ou l’utilisateur peut sélectionner, désélectionner ou sélectionner partiellement certains éléments.

# app_components_checkboxPicker_description_text
source: A checkbox picker makes the user able to select between 0 and all items provided in a list
ar: يتيح checkbox picker للمستخدم اختيار بين 0 وجميع العناصر الموجودة في القائمة.
fr: Le composant Checkbox piocker permet à l'utilisateur de sélectionner entre 0 et tous les éléments fournis dans une liste

# app_components_checkboxPicker_root
source: Your selection
ar: اختياراتك
fr: Votre sélection

# app_components_chip_description_text
source: Chips help people enter information, make selections, filter content, or trigger actions.
ar: تساعد Chips المستخدمين على إدخال المعلومات، القيام باختيارات، تصفية المحتوى، أو تنفيذ إجراءات.
fr: Les Chips aident les utilisateurs à saisir des informations, à effectuer des sélections, à filtrer le contenu ou à déclencher des actions.

# app_components_chip_filterChip_chipContent_label
source: Filter
ar: فلتر
fr: Filtre

# app_components_chip_filterChip_description_text
source: Filter chip is a UI element that allows to select or deselect an option within a series, and is commonly used to capture filtering decisions.
ar: شريحة التصفية هي عنصر من عناصر واجهة المستخدم يسمح بتحديد أو إلغاء تحديد خيار ضمن سلسلة، وتستخدم عادة لالتقاط قرارات التصفية.
fr: Le filtre est un élément d'interface utilisateur qui permet de sélectionner ou de désélectionner une option au sein d'une série, et est couramment utilisé pour enregistrer les décisions de filtrage.

# app_components_chip_suggestionChip_chipContent_label
source: Suggestion
ar: اقتراح

# app_components_chip_suggestionChip_description_text
source: Suggestion chip is a UI element that allows to present recommended or predictive options based on user’s input or context, and is commonly used to capture filtering decisions.
ar: شريحة الاقتراحات هي عنصر من عناصر واجهة المستخدم يسمح بعرض خيارات موصى بها أو تنبؤية بناءً على مدخلات المستخدم أو السياق، وتستخدم عادة لالتقاط قرارات التصفية.
fr: La puce de suggestion est un élément d'interface utilisateur qui permet de présenter des options recommandées ou prédictives en fonction des entrées ou du contexte de l'utilisateur, et est couramment utilisée pour capturer les décisions de filtrage.

# app_components_chipPicker_description_text
source: A chips picker makes the user able to select an item provided in a list
ar: يتيح لك أداة اختيار الرقائق إمكانية تحديد عنصر موجود في القائمة
fr: Le composant Chip picker permet à l'utilisateur de sélectionner un élément fourni dans une liste

# app_components_coloredBackground_description_text
source: Colored backgrounds use surface colors to maximize the contrast with content. Several components such as buttons or links adapt their display accordingly when they are displayed on colored backgrounds.
ar: تستخدم الخلفيات الملونة ألوانًا سطحية لزيادة التباين مع المحتوى. وتكيف العديد من العناصر، مثل الأزرار والروابط، طريقة عرضها عند عرضها على خلفيات ملونة.
fr: Le composant ColoredSurface utilisent des couleurs de surface pour maximiser le contraste avec le contenu. Plusieurs composants, tels que les boutons ou les liens, adaptent leur affichage en conséquence lorsqu'ils sont affichés sur des arrière-plans colorés.

# app_components_common_editContent_label
source: Edit content
ar: تعديل المحتوى
fr: Modifier contenu

# app_components_common_enterText_prompt
source: Enter a text
ar: أدخل نصًا
fr: Entrez un texte

# app_components_common_error_a11y
source: Error Message
ar: رسالة خطأ
fr: Message d’erreur

# app_components_common_icon_a11y
source: This is a dumb accessibility label for an icon
ar: هذه تسمية زائفة لوصف أيقونة
fr: Ceci est un label bidon pour décrire une icône

# app_components_common_label_label
source: Label
ar: تسمية

# app_components_common_textInputClearIcon_a11y
source: Clear value
ar: مسح المدخلات
fr: Effacer le contenu

# app_components_common_version_label
source: Component design version
ar: نسخة تصميم المكون
fr: Version design du composant

# app_components_common_viewCodeExample_label
source: View component code example
ar: مثال على كود مكون العرض
fr: Voir l'exemple de code du composant

# app_components_divider_description_text
source: Divider is a UI element that allows to structure the content by visually separating the content zones. Divider improves readability and content organization without introducing a stronger visual hierarchy like a heading or a container would.
ar: الفاصل هو عنصر من عناصر واجهة المستخدم يساعد في تنظيم المحتوى من خلال الفصل البصري بين أقسامه. يُحسّن الفاصل من سهولة القراءة وتنظيم المحتوى دون إضافة تسلسل هرمي بصري أقوى كما هو الحال مع العناوين أو الحاويات.
fr: Le séparateur est un élément d'interface utilisateur qui permet de structurer le contenu en séparant visuellement les zones de contenu. Le séparateur améliore la lisibilité et l'organisation du contenu sans introduire une hiérarchie visuelle plus forte comme le ferait un titre ou un conteneur.

# app_components_divider_horizontalDivider_description_text
source: A horizontal Divider is used to separate content laid out one under the other
ar: يتم استخدام الفاصل الأفقي لفصل المحتوى الموضوع تحت الآخر
fr: Le variant horizontal du composant est utilisé pour séparer des contenus positionnés côte à côte

# app_components_divider_verticalDivider_description_text
source: A vertical Divider is used to separate content in horizontal layout
ar: يتم استخدام الفاصل الرأسي لفصل المحتوى الموضوع جنبًا إلى جنب
fr: Le variant vertical du composant est utilisé pour séparer des contenus positionnés l’un en dessous de l’autre

# app_components_link_description_text
source: Link is a UI element that allows to navigate from one location to another, either within the same page or across different pages in the same resource, or to an external resource.
ar: الرابط هو عنصر واجهة مستخدم يسمح بالانتقال من مكان إلى آخر، سواء داخل نفس الصفحة أو عبر صفحات مختلفة في نفس المورد، أو إلى مورد خارجي.
fr: Un lien est un élément d'interface utilisateur qui permet de naviguer d'un emplacement à un autre, que ce soit au sein de la même page, entre différentes pages de la même ressource ou vers une ressource externe.

# app_components_passwordInput_description_text
source: Password input is a UI element that allows to securely and confidentially capture a user's password.
ar: Password Input هو حقل نموذج مصمم خصيصًا لالتقاط كلمة مرور المستخدم بسرية. يقوم بإخفاء الأحرف أثناء الكتابة، عادةً باستبدالها بنقاط، لحماية الإدخال من قراءته من قبل الآخرين القريبين. بينما الهدف الأساسي هو تعزيز الخصوصية والأمان، قد يتضمن الحقل أيضًا ميزات سهولة الاستخدام مثل تبديل إظهار/إخفاء كلمة المرور ونص المساعدة لتوجيه إنشاء كلمة المرور.
fr: Le composent PasswordInput est un élément d'interface utilisateur qui permet de capturer de manière sécurisée et confidentielle le mot de passe d'un utilisateur.

# app_components_passwordInputHelperText_label
source: Password must be at least 8 characters.
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل.
fr: Le mot de passe doit contenir au moins 8 caractères.

# app_components_pinCodeInput_description_text
source: PIN code input is a UI element that allows to capture short, fixed-length numeric codes, typically for authentication or confirmation purposes, such as a four, six or eight-digit personal identification number (PIN)
ar: إدخال رمز PIN هو عنصر واجهة مستخدم يسمح بالتقاط رموز رقمية قصيرة وثابتة الطول، عادةً لأغراض المصادقة أو التأكيد، مثل رقم تعريف شخصي (PIN) مكون من أربعة أو ستة أرقام أو أكثر.
fr: La saisie du code PIN est un élément d'interface utilisateur qui permet de capturer des codes numériques courts et de longueur fixe, généralement à des fins d'authentification ou de confirmation, tels qu'un numéro d'identification personnel (PIN) à quatre, six ou huits chiffres.

# app_components_pinCodeInput_errorDescription_label
source: Error description
ar: وصف الخطأ
fr: Message d’erreur

# app_components_pinCodeInputHelperText_label
source: Enter the 6-digit code sent to your phone.
ar: أدخل الرمز المكون من 6 أرقام والذي تم إرساله إلى هاتفك.
fr: Saisissez le code à 6 chiffres envoyé sur votre téléphone.

# app_components_radioButton_description_text
source: Radio button is a UI element that allows to select a single option from a set of mutually exclusive choices.
ar: زر الاختيار هو عنصر من عناصر واجهة المستخدم يسمح بتحديد خيار واحد من مجموعة من الخيارات الحصرية المتبادلة.
fr: Le bouton radio est un élément de l'interface utilisateur qui permet de sélectionner une seule option parmi un ensemble de choix mutuellement exclusifs.

# app_components_radioButton_hint_a11y
source: This is a fake label for the design system toolbox app
ar: هذه تسمية زائفة لتطبيق صندوق أدوات نظام التصميم
fr: Ceci est un label bidon pour l’app de démo du design system

# app_components_radioButton_radioButton_description_text
source: Radio button is a UI element that allows to select a single option from a set of mutually exclusive choices. Radio button that does not show icon or text, provides greater flexibility when creating other components that require a Radio button to be displayed.
ar: زر الاختيار هو عنصر في واجهة المستخدم يسمح باختيار خيار واحد من بين مجموعة من الخيارات الحصرية. يوفر زر الاختيار الذي لا يعرض أيقونة أو نصًا مرونة أكبر عند إنشاء مكونات أخرى تتطلب عرض زر اختيار.
fr: Le bouton radio est un élément de l'interface utilisateur qui permet de sélectionner une seule option parmi un ensemble de choix mutuellement exclusifs. Le bouton radio qui n'affiche pas d'icône ou de texte offre une plus grande flexibilité lors de la création d'autres composants nécessitant l'affichage d'un bouton radio.

# app_components_radioButton_radioButtonItem_description_text
source: Radio button Item is a UI element that allows to select a single option from a set of mutually exclusive choices. Radio button Item covers a wider range of contexts by allowing to toggle the visibility of additional text labels and icon assets.
ar: زر الاختيار المتقدم هو عنصر في واجهة المستخدم يتيح لك اختيار خيار واحد من بين مجموعة من الخيارات الحصرية. يغطي زر الاختيار المتقدم نطاقًا أوسع من السياقات من خلال السماح لك بتفعيل/إيقاف ظهور النصوص والأيقونات الإضافية.
fr: Le bouton radio enrichi est un élément d'interface utilisateur qui permet de sélectionner une seule option parmi un ensemble de choix mutuellement exclusifs. Le bouton radio enrichi couvre un plus large éventail de contextes en permettant de basculer la visibilité des étiquettes de texte et des icônes supplémentaires.

# app_components_radioPicker_description_text
source: Radio picker allows users to chose on item within a group of many radio buttons
ar: يتيح Radio picker للمستخدمين اختيار عنصر واحد من مجموعة من أزرار الراديو.
fr: Le composant Radio Picker permet aux utilisateurs de choisir un élément au sein d'un groupe
